# =============================================================================
# CLI Tools
# =============================================================================
brew "git"
brew "gh"
brew "eza"
brew "zoxide"
brew "ripgrep"
brew "fzf"
brew "fnm"

# Zsh plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-you-should-use"

# =============================================================================
# GUI Applications
# =============================================================================

# Development
cask "zed"
cask "ghostty"
cask "orbstack"
cask "postman"

# Productivity
cask "1password"
cask "notion"
cask "notion-calendar"
cask "slack"
cask "missive"
cask "raycast"

# Utilities
cask "cleanshot"
cask "karabiner-elements"
cask "tailscale"
cask "sip"
